app/controllers/songs_controller.rb

  def new
    @song = Song.new
    @artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 3]]

  def create
    @artist = Artist.find(params[:artist_id])
    @artist.songs.create!(song_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "songs" ("title", "album", "preview_url", "artist_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "new title"], ["album", "new album"], ["preview_url", "new url"], ["artist_id", 1]]

  def show
    @song = Song.find(params[:id])
    @artist = Artist.find(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @song = Song.find(params[:id])
    @artist = Artist.find(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 53]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 2]]